#  Pandas

## Install Pandas

In [4]:
%pip install pandas
%pip install openpyxl
%pip install kagglehub

## Series

### series are also similar as Dictionaries 
### But series has 2 indices 
### 1. Position based Index which is 0,1,2,....
### 2. Label based Index this is optional we can give labels as anything and use them as index.

In [5]:
import pandas as pd

series1=pd.Series([10,20,30,40,50])
print("Position Based Indexing :",series1)

Position Based Indexing : 0    10
1    20
2    30
3    40
4    50
dtype: int64

## Label Based Indexing 
### Give all indices or labels as this 
### index=[list of labels or indices]

In [8]:
series2=pd.Series([10,20,30,40,50],index=["Akash",'Praveen','sindhu','lilly','andy'])
print("Label Based Indexing")
series2

Label Based Indexing

Akash      10
Praveen    20
sindhu     30
lilly      40
andy       50
dtype: int64

# DataFrames

## DataFrames are nothing but tables.
## any data can be converted as a DataFrame.
## they should have rows and cols thats it
## 1. python 2d lists to dataFrames
## 2. Python Dictionaries to DataFrames.
## 3. excel tables to DataFrames.
## 4. csv to DataFrames
## 5. read data from url and convert to DataFrames
## 6. read Data from json and convert them to DataFrames.

### In json and dict key value pairs 
### keys are considered as rows and values are considered as cols.

# Read Any type of Data and store it in DataFrames.

## Lists to DataFrames

In [9]:
Data=pd.DataFrame([
    [10, 'akash', 'cse'],
    [40,'andy','Finance'],
    [50,'lilly','mech']
])
Data

    0      1        2
0  10  akash      cse
1  40   andy  Finance
2  50  lilly     mech

In [10]:
# we can also Label cols
Data=pd.DataFrame([
    [10, 'akash', 'cse'],
    [40,'andy','Finance'],
    [50,'lilly','mech']
],columns=["No", "Name","Branch"])
Data

   No   Name   Branch
0  10  akash      cse
1  40   andy  Finance
2  50  lilly     mech

## Dicitionaries to DataFrames.

In [11]:
dic={'a':[1],'b':[2],'c':[3]}
data=pd.DataFrame(dic)
data

   a  b  c
0  1  2  3

In [12]:
dic={'number':[1,2,3,4],'name':['akash','Andy','lilly','jean']}
data=pd.DataFrame(dic)
data

   number   name
0       1  akash
1       2   Andy
2       3  lilly
3       4   jean

## Read Data From Excel

In [13]:
excelData=pd.read_excel("excelDataForPandas.xlsx")
print("Excel Data Converted into a DataFrame.")
excelData

Excel Data Converted into a DataFrame.

   Number   Name Dept
0      10  AKASH  CSE
1      20   ANDY  MEC
2      30  LILLY  CSD
3      40   JEAN  CSD

# Read Data From CSV file and convert into a Dataframe.

In [14]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("uciml/iris")

print("Path to dataset files:", path)

Downloading from https://www.kaggle.com/api/v1/datasets/download/uciml/iris?dataset_version_number=2...

/lib/python3.12/site-packages/kagglehub/clients.py:274: TqdmMonitorWarning: tqdm:disabling monitor support (monitor_interval = 0) due to:
can't start new thread
  with tqdm(total=total_size, initial=size_read, unit="B", unit_scale=True, unit_divisor=1024) as progress_bar:
100%|██████████| 3.60k/3.60k [00:00<00:00, 1.23MB/s]

Extracting files...
Path to dataset files: /home/pyodide/.cache/kagglehub/datasets/uciml/iris/versions/2

In [17]:
csvData=pd.read_csv("Iris.csv")
csvData

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

# Read Data From a json

In [15]:
jsonData=pd.read_json("jsonData.json")
jsonData

   number   name Dept
0      10  akash  cse
1      20  lilly  mec
2      30   Andy  csd

# EDA(Exploratory Data Analysis) Using Pandas

# 1. df.head()
###  Displays first 5 rows
# 2. df.tail()
### Last 5 Rows
# 3. df.info()
###   To know about Data Types and columns, no of null Values.
# 4. df.describe()
###  To get Satastic analysis of Data (Mean, std...)
# 5. df.columns
###  Displays columns.
# 6. df.shape
### Returns the shape or dimesnions

In [18]:
Data=csvData
print("EDA is Going to Do on this Data :")
Data

EDA is Going to Do on this Data :

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [35]:
Data.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [34]:
Data.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [36]:
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 6.5+ KB

In [37]:
Data.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [41]:
Data.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [42]:
Data.shape

(150, 6)

# Data Selection and Filtering

In [19]:
Data.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

## Select Cloumns

### Single set of columns

In [21]:
Data['SepalLengthCm']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: SepalLengthCm, Length: 150, dtype: float64

### Multiple set of columns

In [22]:
Data[["SepalLengthCm","Id"]]

     SepalLengthCm   Id
0              5.1    1
1              4.9    2
2              4.7    3
3              4.6    4
4              5.0    5
..             ...  ...
145            6.7  146
146            6.3  147
147            6.5  148
148            6.2  149
149            5.9  150

[150 rows x 2 columns]

# selecting rows

In [29]:
# Added labels to 2 rows
data = data.rename(index={0: 'Row1', 1: 'Row2'})
data

      number   name
Row1       1  akash
Row2       2   Andy
2          3  lilly
3          4   jean

## Label Based Indexing

In [31]:
# 2nd row 
data.loc['Row2']

number       2
name      Andy
Name: Row2, dtype: object

## Position Based Indexing

In [32]:
data.iloc[1]

number       2
name      Andy
Name: Row2, dtype: object

# Selecting Specific cell 
# There are 2 options using 1) iloc ,loc 2) at,iat
# But iat,at is more optimized to access a single element.

# 1. Using iloc,loc

### label Based Indexing

### label Based Indexing

In [34]:
print("Data :")
data

Data :

      number   name
Row1       1  akash
Row2       2   Andy
2          3  lilly
3          4   jean

In [33]:
data.loc['Row2','name']

'Andy'

## Positional Based Indexing

In [35]:
print("Data :")
data

Data :

      number   name
Row1       1  akash
Row2       2   Andy
2          3  lilly
3          4   jean

In [37]:
data.iloc[1,1]

'Andy'

# 1. Using iat,at

In [35]:
print("Data :")
data

Data :

      number   name
Row1       1  akash
Row2       2   Andy
2          3  lilly
3          4   jean

# Label Based Indexing

In [39]:
data.at['Row2','name']

'Andy'

In [ ]:
Positional Based Indexing